---
title: FAQ
description: 
---

<div class="container editable">
				<h1>Was bedeutet Corvy?</h1>
				<p>CORVY setzt sich aus den Begriffen <strong>CORE</strong> (Fundament) &amp; <strong>HEAVY</strong> (tragf&auml;hig) zusammen. Im Vordergrund unserer Philosophie steht demnach ein <strong>tragf&auml;higes Fundament</strong>, das aus Becken und Rumpf besteht. F&uuml;r dieses tragf&auml;hige Fundament sorgen die von uns vermittelten <strong>vier S&auml;ulen</strong>. Die Basis dabei bilden <strong>Mobilit&auml;t und Stabilit&auml;t (1, 2)</strong>, denn nur wenn du mobil und stabil bist, kannst du <strong>Kraft- und Ausdauer&uuml;bungen (3, 4)</strong> korrekt und effizient ausf&uuml;hren. Test</p>
				<div class="image"><img alt="Screenshot" style="width: 50%;" src="/images/4s.png" /></div>
				<p>Der Pfeil symbolisiert deinen Trainingsprozess auf deiner selbst gew&auml;hlten <strong>Intensit&auml;tsstufe</strong>, wenn deine 4 S&auml;ulen sich verbessern, gelangst du in die n&auml;chste <strong>Schwierigkeitsebene</strong>. Dein Trainer unterst&uuml;tzt dich jederzeit mit Tipps zur Verbesserung und zur Korrektur von Fehlhaltungen.</p>
				<h1>Was ist Corvy?</h1>
				<p>CORVY ist ein <strong>individuell</strong> auf dich zugeschnittenes <strong>Fitnessprogramm</strong>. Wir m&ouml;chten dich durch eine k&ouml;rperliche Diagnose zielgerichtet sportlich und gesundheitlich f&ouml;rdern, indem wir auf viel frische Luft setzen (Outdoortraining) und dabei auf vier S&auml;ulen aufbauend trainieren:</p>
				<p><u>Mobilit&auml;t</u>: Am Anfang jeder Trainingseinheit steht ein 50-min&uuml;tiges Warm-up der Gelenke und der Wirbels&auml;ule. Darauf folgt eine gezielte Korrektur von bereits vorhandenen Fehlstellungen, was wichtig ist, damit du eine richtige Haltung erlangst und die folgenden&Uuml;bungen korrekt und qualitativ gut ausf&uuml;hren kannst.</p>
				<p><u>Stabilit&auml;t</u>: Die richtige Haltung, die wir bei den Mobilit&auml;ts&uuml;bungen erarbeitet haben, st&auml;rken wir nun, indem wir 30 Minuten &uuml;ber Atem&uuml;bungen, Bewegungs- sowie Halte&uuml;bungen die verschiedenen Muskelpartien anspannen.</p>
				<p><u>Kraft:</u> Hier geht es nun darum, dass die verschiedenen Muskelgruppen durch Wiederholungen gest&auml;rkt werden und in ihrem vollen Beweglichkeitsradius beansprucht werden. Mobilit&auml;t und Stabilit&auml;t werden dabei als Grundf&auml;higkeiten eingebracht. Der Kraftteil dauert 20 Minuten.</p>
				<p><u>Ausdauer:</u> Auch das 15-min&uuml;tige zielgerichtete Training des Herz-Kreislauf-Systems steht bei jeder Einheit auf dem Programm. Durch eine Kombination von abwechslungsreichen Koordinations- und Schnellkraft&uuml;bungen wird die sportliche Leistungsf&auml;higkeit gef&ouml;rdert. Das Training schlie&szlig;t mit einem 5-min&uuml;tigen Cool-down-Programm</p>
				<p>Durch unser Training verbesserst du deine K&ouml;rperhaltung und dein Wohlbefinden, was vor allem bedeutet, dass du schmerzfrei, leistungsf&auml;hig und k&ouml;rperlich gest&auml;rkt wirst.</p>
			</div>